Revit 2026 API

# ParameterUtilsDownloadParameterOptions Method

---

Retrieves settings associated with the given parameter from the Parameters Service.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ParameterDownloadOptions DownloadParameterOptions(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Shared Function DownloadParameterOptions (
	parameterTypeId As ForgeTypeId
) As ParameterDownloadOptions
```
```cpp
public:
static ParameterDownloadOptions^ DownloadParameterOptions(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
static member DownloadParameterOptions :
        parameterTypeId : ForgeTypeId -> ParameterDownloadOptions
```

#### Parameters

parameterTypeId ForgeTypeId
     Parameter identifier.

#### Return Value

ParameterDownloadOptions Settings associated with a parameter.

| Exception | Condition |
| --- | --- |
| AccessDeniedException | Thrown when the user is not authorized to access the requested information. |
| ArgumentException | Thrown when the given parameter identifier is empty. |
| ArgumentNullException | A non-optional argument was null |
| [!:Autodesk::Revit::Exceptions::NetworkCommunicationError] | Thrown when communication with the Parameters Service is unsuccessful. |
| ResourceNotFoundException | Thrown when the requested parameter is not found. |
| ServerInternalException | Thrown when the Parameters Service reports an internal error. |
| UnauthenticatedException | Thrown when the user is not signed in. |

The settings associated with a parameter definition are accessible only to an authorized user. To retrieve them, the user must be signed in.

#### Reference

ParameterUtils Class

Autodesk.Revit.DB Namespace